Autodesk.Revit.DB.TessellatedShapeBuilder.CreateMeshByExtrusion(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop},Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.ElementId)
Builds a mesh by extruding curve loop(s) along extrusion distance.
Remarks:
This function supports creation of a mesh given a collection
of continuous curve loops, which are processed independently
from each other. Loops with gaps or with curves with
wrong flips will be split before processing.
profileLoops:
The profile loops to be extruded. The loops will not be modified.
extrusionDirection:
Direction of extrusion. The length of this vector is ignored.
extrusionDistance:
The positive distance by which the loops are extruded in the
direction of the input extrusionDir.
materialId:
Material which should be used by a constructed mesh.
Returns:
Returns a mesh, which was constructed, and some additional
information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input value cannot be used as thickness for an extrusion,
or blend, or wall layer, or similar geometric construct.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
extrusionDirection has zero length.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.AddFace(Autodesk.Revit.DB.TessellatedFace)
Adds a face to the currently open connected face set.
face:
Face to add. The 'face' parameter can be added only once, as its
boundary loops will be cleared while adding and 'face' will become unusable.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The 'face' does not have enough loops and/or vertices to be valid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
A face set is closed and faces cannot be added to it.
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.DoesFaceHaveEnoughLoopsAndVertices(Autodesk.Revit.DB.TessellatedFace)
Checks whether 'face' has enough loops and vertcies to be valid.
Remarks:
Face 'face' is not modified.
face:
The face to check.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.OwnerInfo
String used for logging, if any. Usually describes the element or object, which
either defined or will own the geoemtrical objects to be built.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.LogString
String used for logging, if any. Usually the name of the file from which
face sets were imported.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.TessellatedShapeBuilder.GraphicsStyleId
Optional - if set, the built geometry will use that graphics style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017